const initialDetails = [
{
        id: 5,
        biografy: [
            {
                id: 1,
                title: 'Рождение',
                text: 'Родился 22 октября (3 ноября) 1882 года в деревне Акинчицы (теперь территория города Столбцы Столбцовского района Минской области Белоруссии), в православной семье лесника Михаила Казимировича (Михася) Мицкевича и домохозяйки Анны Юрьевны Лесик. Предки по отцовской линии — католики. ',
                time: '3 ноября 1882 года',
                logo: "life",
            },
            {
                id: 2,
                title: 'Образование и преподавание',
                text: 'Окончил народную школу, в 1902 году — Несвижскую учительскую семинарию. Работал учителем на Пинщине (1902—1906). В 1906 году первая публикация — стихотворение «Край родимый» в белорусской газете «Наша доля». В 1907 году возглавлял литературный отдел белорусской газеты «Наша Нива» в Вильне[5]. За участие в организации нелегального учительского съезда 1906 года был приговорён к заключению, которое отбывал в минской тюрьме (1908—1911). В 1912—1914 годах учительствовал в Пинске. Здесь в 1914 году у него родился его старший сын Даниил, который впоследствии стал создателем и первым директором музея своего отца. В 1917 родился его средний сын — Юрий Константинович Мицкевич, а в 1926 младший сын — Михаил Константинович (Михась) Мицкевич. ',
                time: 'до 1915 года',
                logo: "school",
            },
            {
                id: 3,
                title: 'Творчество',
                text: 'До Октябрьской революции вышли сборники стихов «Песни неволи» (1908), «Песни печали» (1910), отдельные главы эпической поэмы «Новая зямля»[9], а также сборники прозы «Рассказы» (1912), «Родные образы» (1914). В двадцатых годах XX века были опубликованы поэмы «Новая земля» (1923), «Сымон-музыкант» (1925), повести «В полесской глуши» (1922), «В глубине Полесья» (1928), «На просторах жизни» (1926), отдельные лирические стихотворения, пьесы. В тридцатых годах написаны циклы стихов «Колхозное» (1930), «Осеннее» (1935), повесть «Отщепенец» (1930—1931). События революции и гражданской войны отражены в повести «Трясина» («Дрыгва», 1933). ',
                time: '1906 — 1956 года',
                logo: "work",
            },
            {
                id: 4,
                title: 'Смерть',
                text: 'В конце жизни часто болел, в частности, перенёс 26 воспалений лёгких. Скончался 13 августа 1956 года. Похоронен на Военном кладбище в Минске.',
                time: '13 августа 1956 года.',
                logo: "death",
            },
        ],
        info: {
            imgPath: 'https://upload.wikimedia.org/wikipedia/commons/thumb/b/be/Kanstantyn_Mickievi%C4%8D_%28Jakub_Ko%C5%82as%29._%D0%9A%D0%B0%D0%BD%D1%81%D1%82%D0%B0%D0%BD%D1%82%D1%8B%D0%BD_%D0%9C%D1%96%D1%86%D0%BA%D0%B5%D0%B2%D1%96%D1%87_%28%D0%AF%D0%BA%D1%83%D0%B1_%D0%9A%D0%BE%D0%BB%D0%B0%D1%81%29_%281925%29.jpg/640px-Kanstantyn_Mickievi%C4%8D_%28Jakub_Ko%C5%82as%29._%D0%9A%D0%B0%D0%BD%D1%81%D1%82%D0%B0%D0%BD%D1%82%D1%8B%D0%BD_%D0%9C%D1%96%D1%86%D0%BA%D0%B5%D0%B2%D1%96%D1%87_%28%D0%AF%D0%BA%D1%83%D0%B1_%D0%9A%D0%BE%D0%BB%D0%B0%D1%81%29_%281925%29.jpg',
            name: 'Якуб Колос',
            url: '/kolos',
            date: '3 ноября 1882 года - 13 августа 1956 года',
            details: 'Белорусский советский писатель, драматург, поэт и переводчик, общественный деятель. Один из классиков и основоположников новой белорусской литературы. Народный поэт Белорусской ССР. Академик АН Белорусской ССР. Член СП СССР. Заслуженный деятель науки Белорусской ССР.',
            img1: 'http://problr.by/images/pro_belarus/izvestnye_ludi/Yakub_Kolas_1.jpg',
            img2: 'https://knigaplus.ru/images/cms/thumbs/41baad0954b693d187192070f267e08cec7c90f8/kolos_stihotvoreniya_auto_420_jpeg_5_100.jpeg',
            img3: 'http://gdetut.by/uploads/posts/2018-08/1535091166_muzej_gosudarstvennyj-literaturnyj-m_minsk-akademicheskaya-5_about_19.jpg',
            
            center: { lat: 53.919519517942, lng: 27.600111712740734 },
            video: 'HxFeWGZspJQ'
        }
    },
    {
        id: 1,
        biografy: [
            {
                id: 1,
                title: 'Рождение',
                text: 'Родился в семье обедневшего дворянина Казимира Богушевича в фольварке Свираны Завилейского уезда Виленской губернии (теперь Свиронис Вильнюсского района Литвы).',
                time: '21 марта 1840 года',
                logo: "life",
            },
            {
                id: 2,
                title: 'Образование',
                text: 'Начальное образование получил в Виленской гимназии, которую закончил в 1861 году. В том же году поступил в Петербургский университет на физико-математический факультет. В знак протеста против новых университетских правил, которые ограничивали права учащихся, студенты, вернувшись с летних каникул, отказались принимать матрикулы. Борьба закончилась кровавой стычкой на университетском крыльце 24 октября. Вероятно, эти события подтолкнули Богушевича 14 ноября написать заявление на имя ректора с просьбой уволить его из университета из-за тяжелой болезни и неблагоприятного климата. ',
                time: 'до 24 октября 1861',
                logo: "school",
            },
            {
                id: 3,
                title: 'Творчество',
                text: 'Богушевич писал и печатал свои произведения латиницей. Сейчас они издаются кириллицей, поэтому современный читатель не может оценить все особенностей богушевичского письма, способы передачи поэтом белорусской фонетики латиницей. Истоки творчества Ф. Богушевича — в общественной жизни Белоруссии, они тесно связаны с фольклором, а также с лучшими эстетическими традициями славянской поэзии. Богушевич — основоположник критического реализма в белорусской литературе. Он автор двух сборников стихотворений — «Dudka biаłaruskaja» и «Smyk biаłaruski», которые издал в Австро-Венгрии. Первыми известными поэтическими пробами Франциска Богушевича считают найденные во Львове стихотворения на польском языке: «Новый год 1886» («Nowy rok 1886»), «Призрак надежды» («Widmo nadziei»), «Кто это?» («Kto to?»), — написанные в 1885—1886 гг. В архиве Яна Карловича сохранился автограф басни Ф. Богушевича на белорусском языке «Волк, ягнёнок, овца» («Воўк, ягня, авечка», по содержанию, 1886). ',
                time: '1885 — 1900 года',
                logo: "work",
            },
            {
                id: 4,
                title: 'Смерть',
                text: 'Возвратился на родину, работал учителем в селении Дота. Участвовал в Польском восстании 1863—1864 годов в отряде Людвика Нарбутта, был ранен. После разгрома восстания жил в Российской империи, учился в Нежинском юридическом лицее. Работал адвокатом, защитником прав крестьянства. После амнистии для всех участников восстания, приуроченной к восхождению на трон Александра III, переехал с семьёй в Вильно. Работал в адвокатской конторе, писал статьи в польскоязычный журнал «Край». После увольнения жил в Кушлянах (теперь Сморгонский район), где и умер. Похоронен в деревне Жупраны Ошмянского района.',
                time: '28 апреля 1900 года',
                logo: "death",
            }
        ],
        info:
        {
            imgPath: 'https://upload.wikimedia.org/wikipedia/commons/thumb/d/d8/Francishak_Bahushevich_-_bf_1890_AD_grey.jpg/274px-Francishak_Bahushevich_-_bf_1890_AD_grey.jpg',
            name: 'Франциск Богушевич',
            url: '/bogush',
            date: '21 марта 1840 - 28 апреля 1900',
            details: 'Белорусский поэт, один из основоположников новой белорусской литературы. Основоположник критического реализма в белорусской литературе.',
            img1: 'https://www.nlb.by/upload/iblock/21b/af.jpg',
            img2: 'https://libcat.ru/uploads/posts/pictures/187428-bahusevic_tvory_apisannie_630.jpg',
            img3: 'https://www.nlb.by/upload/medialibrary/7bf/bahushevich.jpg',
            center: { lat: 54.999624257150394, lng: 26.655251626304334 },
            video: '2SEHtuDrcQY',
        }
    },
    {
        id: 4,
        biografy: [
            {
                id: 1,
                title: 'Рождение',
                text: 'На момент свадьбы Адаму Богдановичу было 26, а Марии — 19 лет. Он вспоминал о супружестве как об одном из счастливейших периодов своей жизни. Учитель 1-ого городского училища Минска Адам Егорович Богданович (1862—1940) и его жена Мария Афанасьевна (1869—1896) были материально обеспечены: Адам зарабатывал до 1500 рублей в год при готовой квартире с отоплением и освещением, располагавшейся на Троицкой горе на улице Александровской в доме Коркозовича, что во дворе, во втором этаже; в то время в нём помещалось 1-е приходское училище и учительские квартиры, позднее это был дом 25 (ныне здесь участок улицы М. Богдановича напротив сквера возле Театра оперы и балета. Первенец Вадим родился 6 (18) марта 1890 года, Максим — 27 ноября (9 декабря) 1891 года в 9 часов вечера. ',
                time: '9 декабря 1891 года',
                logo: "life",
            },
            {
                id: 2,
                title: 'Образование',
                text: 'В 1902 году Максим поступил в Нижегородскую мужскую гимназию. Во время Революции 1905 года принимает участие в ученических и студенческих демонстрациях, за что получает аттестацию «неблагонадёжного ученика». В 1906 году крестная мать Максима В. Сёмова выписывает для него газету «Наша доля», а потом и «Нашу ниву». В конце года Богданович присылает белорусские книги и газеты в Нижегородскую тюрьму революционеру белорусского происхождения Степану Зенченко. Окончив в 1911 году гимназию, он посещает Вильну, знакомится с Вацлавом Ластовским, Антоном и Иваном Луцкевичами и другими деятелями белорусского Возрождения. Будучи в Вильне, молодой поэт ознакомился в частном музее братьев Луцкевичей с коллекциями древних раритетов, и под их впечатлением написал стихотворение «Слуцкие ткачихи». В этом произведении автор рассказывает печальную историю крепостных ткачих, поэтизируя умельство мастериц ткать золотые пояса, куда они добавляют «вместо персидского узора цветок родимый василька». В том же году Максим Богданович намеревался поступить на Филологический факультет Петербургского университета, но из-за недостатка средств и сырого климата столицы, возвращается в Ярославль, поступив в Демидовский юридический лицей.  По словам отца, «внутренняя сторона» жизни Максима Богдановича чуть ли не целиком поглощалась его учением как под­готовкой к общественной и литературной работе, его писательством, его творчеством; на всё остальное и времени, и сил оставалось очень мало.  Много времени уходило на изучение западно-европейских и славянских языков и литератур, особенно на изучение белорусского языка, истории, этнографии, литературы.  Во время учёбы сотрудничает в ярославской газете «Голос»; много пишет, печатается в различных российских и белорусских изданиях, приобретает известность. ',
                time: 'до 1916 года',
                logo: "school",
            },
            {
                id: 3,
                title: 'Творчество',
                text: 'По мнению литературоведа И. И. Замотина (1873—1942), в творчестве Богдановича находили отражение литературные искания и предреволюционные настроения начала века, белорусское возрождение и старина, личные переживания; на многих его стихотворениях и повестях лежит общий грустный колорит, вызванный противоречивой эпохой, а также обусловленный болезнью поэта и предчувствием близкого конца; но Богданович верит в обновление жизни и ждёт его с надеждою. Максим Богданович создал много прекрасных образцов гражданской, пейзажной, философской лирики; написал ряд любовных стихов, посвящённых Анне Кокуевой (ярославская знакомая поэта, в которую он был влюблён). Лирика Богдановича тесно связана с устной народной поэзией, национально-освободительными идеями, проникнута любовью к трудовому народу. В некоторых стихах звучит протест против мира насилия и социальной несправедливости',
                time: '1907 — 1917 года',
                logo: "work",
            },
            {
                id: 4,
                title: 'Смерть',
                text: 'В феврале 1917 года друзья поэта собрали деньги, чтобы он мог ехать в Крым лечиться от туберкулёза. Но лечение не помогло. Умер Максим Богданович на рассвете 13 (25) мая 1917 года в возрасте 25 лет (из горла пошла кровь). ',
                time: '25 мая 1917 года',
                logo: "death",
            },
        ],
        info: {
            imgPath: 'https://upload.wikimedia.org/wikipedia/commons/thumb/5/56/Bagdanovich_M_2.jpg/274px-Bagdanovich_M_2.jpg',
            name: 'Максим Богданович',
            url: '/bogdanovich',
            date: '9 декабря 1891 года - 25 мая 1917 года',
            details: 'Белорусский поэт, публицист, литературовед, переводчик; классик белорусской литературы, один из создателей белорусской литературы и современного литературного белорусского языка.',
            img1: 'https://posmotrim.by/pics/56d9fad47.jpg',
            img2: 'https://www.sb.by/upload/iblock/e7a/e7aa52227a7ba2453c5282dd5521844e.jpg',
            img3: 'https://grodnonews.by/upload/resize_cache/iblock/e00/924_560_2/e004ec4bb4f6f33eb112b2e4b26bcbb5.jpg',
            
            center: { lat: 53.93521586108235, lng: 27.623058891577188 },
            video: 'ASaN7iVmR2I',
        }
    },
    {
        id: 2,
        biografy: [
            {
                id: 1,
                title: 'Рождение',
                text: 'Самуил (Шмуэл-Нохим) Плавник, впоследствии известный под литературным псевдонимом Змитрок Бядуля, родился в небогатой еврейской семье (д. Посадец, Виленская губерния, Российская империя, ныне Логойский район Минской области). Учился в хедере. Владел идишем, древнееврейским, белорусским, русским и немецким. ',
                time: '23 апреля 1886 года',
                logo: "life",
            },
            {
                id: 2,
                title: 'Образование',
                text: 'В семь лет Самуил пошёл в начальную еврейскую школу (хедер). После её окончания поступил в Долгиновскую школу раввинов (иешиву), затем перешёл в Ильянскую иешиву, но не окончил ни одну из них из-за своего вольнодумства и конфликтов с администрацией (позже описанных, в частности, в повести «В дремучих лесах») и вернулся домой. Работал домашним учителем, а с 1902 года — конторщиком на лесозаготовках',
                time: 'до 1902 года (предположительно)',
                logo: "school",
            },
            {
                id: 3,
                title: 'Творчество',
                text: 'Поначалу Бядуля ориентировался на старинную еврейскую литературу (на религиозные произведения тех времён). Но позже отказался от этой манеры письма и начал изучать современную литературу. Тогда он и начал писать стихи и рассказы на русском языке, подражая манере знаменитых поэтов XIX века. Но белорусские язык и культура всё равно врывались в его произведения. В 1909 году в руки Змитрока попала белорусскоязычная газета «Наша Ніва» благодаря одному из соседей (постоянному корреспонденту газеты Вульфу Сосенскому, который и рекомендовал редакции нового автора). Сам факт существования «простонародного» издания впечатлил молодого человека, и газета очень повлияла на его мировоззрение. В середине 1910 года З. Бядуля отдал в редакцию «Нашай Нівы» свои стихи, но они не были опубликованы, возможно, потому, что были ещё незрелыми. Однако в том же году в газете появилось его первое опубликованное произведение — импрессия «Пяюць начлежнікі».  Для ранних произведений Бядули, как для стихов, так и для прозы, был характерен романтизм. Чтобы передать мировоззрение и богатство духовной и культурной жизни человека вообще и крестьян в особенности, Бядуля стремился подражать Я. Купале и Я. Коласу. В середине 1910-х годов поэт начал подписываться своим литературным псевдонимом.  Романтизм Бядули был виден даже в описаниях природы и быта, превозносились и люди. Но со временем писатель всё же выбрал реализм и увлёкся психологически-бытовыми зарисовками. Он стремился показать жизнь как можно более реальной. В своих произведениях писатель стремился показать тяжелую долю рабочих («Ля вапеннай гары»), рассказывал о горе людей, пострадавших от пожара («Чырвоная казка»), показал трагедию крестьянина в столкновении с жестокостью жизни («Без споведзі»). Показал сложность крестьянской жизни, чему помогала близость литератора к селянам и понимание души крестьянства.  В 1911—1912 стихи Бядули на русском языке печатались в журналах «На берегах Невы» (Санкт-Петербург) и «Молодые порывы» (Вильно). В 1913 он опубликовал сборник лирических импрессий на белорусском языке «Абразкі» (Петербург), с тех пор писал почти исключительно по-белорусски. ',
                time: '1885 — 1900 года',
                logo: "work",
            },
            {
                id: 4,
                title: 'Смерть',
                text: 'После вторжения Германии в СССР в 1941 году писатель был вынужден покинуть Белоруссию. В эвакуации жил сначала в Пижме Горьковской области, затем, до конца октября 1941 года, в посёлке Новые Бурасы Саратовской области. Скончался около Уральска в Казахстане, где и был похоронен.',
                time: '3 ноября 1941 года',
                logo: "death",
            },
        ],
        info: {
            imgPath: 'https://upload.wikimedia.org/wikipedia/commons/thumb/a/a2/Samui%C5%82_P%C5%82a%C5%ADnik_%28%C5%B9mitrok_Biadula%29._%D0%A1%D0%B0%D0%BC%D1%83%D1%96%D0%BB_%D0%9F%D0%BB%D0%B0%D1%9E%D0%BD%D1%96%D0%BA_%28%D0%97%D1%8C%D0%BC%D1%96%D1%82%D1%80%D0%BE%D0%BA_%D0%91%D1%8F%D0%B4%D1%83%D0%BB%D1%8F%29_%281920-29%29.jpg/255px-Samui%C5%82_P%C5%82a%C5%ADnik_%28%C5%B9mitrok_Biadula%29._%D0%A1%D0%B0%D0%BC%D1%83%D1%96%D0%BB_%D0%9F%D0%BB%D0%B0%D1%9E%D0%BD%D1%96%D0%BA_%28%D0%97%D1%8C%D0%BC%D1%96%D1%82%D1%80%D0%BE%D0%BA_%D0%91%D1%8F%D0%B4%D1%83%D0%BB%D1%8F%29_%281920-29%29.jpg',
            name: 'Змитрок Бядуля',
            url: '/bidulya',
            date: '23 апреля 1886 года - 3 ноября 1941 года',
            details: 'Белорусский и советский писатель и поэт, лексикограф.',
            img1: 'https://www.nlb.by/upload/medialibrary/cd9/zbkrytykatitul.jpg',
            img2: 'https://kurjer.info/wp-content/uploads/2021/06/210614_byadulya.jpg',
            img3: 'https://s14.stc.yc.kpcdn.net/share/i/12/11248093/de-1200x900.jpg',
            
            center: { lat: 54.42642058346641, lng: 27.49049782047012 },
            video: 'GB_rlueYscM',
        }

    },
    {
        id: 3,
        biografy: [
            {
                id: 1,
                title: 'Рождение',
                text: 'Родился 12 (25) июня 1905 года в деревне Путилковичи (ныне Ушачский район, Витебская область, Беларусь) в крестьянской семье (9 детей). Отец — Устин Адамович. Мать — Алёна Степановна',
                time: '25 июня 1905 года',
                logo: "life",
            },
            {
                id: 2,
                title: 'Образование',
                text: 'Окончил церковно-приходскую школу в Лепеле и затем педагогический факультет БГУ',
                time: 'до 1931 года',
                logo: "school",
            },
            {
                id: 3,
                title: 'Творчество',
                text: 'Литературной деятельностью занимался с 1926 года. Дебютировал в газете «Чырвоная Полаччына» и в литературном альманахе «Наддзвінне».  Опубликовал ряд книг стихов и поэм: «К родным берегам», «Избранные стихи и поэмы» (1934), «Приход героя» (1935), «Весна родины» (1937), «Путями боровыми» (1940). Подвиг народа, его мужество и стойкость Бровка отразил в лиро-эпических поэмах «Беларусь» (1943), «Поэма про Смолячкова» (1942), стихах «Будем сеять, белорусы!», «Кастусь Калиновский», «Надя-Надейка», «Могила бойца». Поэмы «Ясный Кут», «Полонянка» (1945), «Хлеб» (1946), стихи «Парк Победы», «Смерть героя», «Кузнец» отмечены тонким лиризмом, ярким национальным колоритом.  В 1957 году написал роман «Когда сливаются реки», посвящённый строительству ГЭС на границе трёх республик, дружбе белорусов, литовцев и латышей.  Переводил на белорусский язык произведения Т. Шевченко, В. Маяковского, П. Тычины, Н. Бажана, А. Твардовского, М. Исаковского, А. Прокофьева, В. Броневского, Дж. Байрона. ',
                time: '1885 — 1900 года',
                logo: "work",
            },
            {
                id: 4,
                title: 'Смерть',
                text: 'П. У. Бровка умер 24 марта 1980 года в Минске. Похоронен на Восточном кладбище',
                time: '24 марта 1980 года',
                logo: "death",
            },
        ]
        ,
        info: {
            imgPath: 'https://upload.wikimedia.org/wikipedia/commons/thumb/3/33/%D0%9C._%D0%93%D1%83%D1%81%D0%B5%D1%9E._%D0%9F%D1%8F%D1%82%D1%80%D1%83%D1%81%D1%8C_%D0%91%D1%80%D0%BE%D1%9E%D0%BA%D0%B0.jpg/274px-%D0%9C._%D0%93%D1%83%D1%81%D0%B5%D1%9E._%D0%9F%D1%8F%D1%82%D1%80%D1%83%D1%81%D1%8C_%D0%91%D1%80%D0%BE%D1%9E%D0%BA%D0%B0.jpg',
            name: 'Петрусь Бровка',
            url: '/brovka',
            date: '25 июня 1905 года - 24 марта 1980 года',
            details: 'Белорусский советский писатель, поэт и переводчик, драматург, публицист. Народный поэт Белорусской ССР. Герой Социалистического Труда. Академик АН БССР. Лауреат Ленинской и двух Сталинских премий.',
            img1: 'https://i.ytimg.com/vi/LozL_I6RlxA/maxresdefault.jpg',
            img2: 'https://vetliva.ru/upload/resize_cache/iblock/819/1170_640_2ad00f77cb8d50abfaeeae09efd4a5122/81947d3c50a8821db6eafadd747b89f0.jpg',
            img3: 'https://www.sb.by/upload/medialibrary/a34/a347fe9cba099a1919f282b664639721.jpg',
            center: { lat: 54.938395825097615, lng: 28.384030602158138 },
            video: '7xHGTr4EbK4',
        }

    },
];

export default initialDetails;